name: "googlenet_bn_cub_two_st"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 224
    mean_value: 104.0
    mean_value: 117.0
    mean_value: 123.0
  }
  data_param {
    source: "data/cub_nocrop_train"
    batch_size: 16
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 224
    mean_value: 104.0
    mean_value: 117.0
    mean_value: 123.0
  }
  data_param {
    source: "data/cub_nocrop_test"
    batch_size: 16
    backend: LMDB
  }
}
layer {
  name: "st/conv1/7x7_s2"
  type: "Convolution"
  bottom: "data"
  top: "st/conv1/7x7_s2"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/conv1/7x7_s2/bn"
  type: "BN"
  bottom: "st/conv1/7x7_s2"
  top: "st/conv1/7x7_s2/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/conv1/relu_7x7"
  type: "ReLU"
  bottom: "st/conv1/7x7_s2/bn"
  top: "st/conv1/7x7_s2/bn"
}
layer {
  name: "st/pool1/3x3_s2"
  type: "Pooling"
  bottom: "st/conv1/7x7_s2/bn"
  top: "st/pool1/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "st/conv2/3x3_reduce"
  type: "Convolution"
  bottom: "st/pool1/3x3_s2"
  top: "st/conv2/3x3_reduce"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/conv2/3x3_reduce/bn"
  type: "BN"
  bottom: "st/conv2/3x3_reduce"
  top: "st/conv2/3x3_reduce/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/conv2/relu_3x3_reduce"
  type: "ReLU"
  bottom: "st/conv2/3x3_reduce/bn"
  top: "st/conv2/3x3_reduce/bn"
}
layer {
  name: "st/conv2/3x3"
  type: "Convolution"
  bottom: "st/conv2/3x3_reduce/bn"
  top: "st/conv2/3x3"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/conv2/3x3/bn"
  type: "BN"
  bottom: "st/conv2/3x3"
  top: "st/conv2/3x3/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/conv2/relu_3x3"
  type: "ReLU"
  bottom: "st/conv2/3x3/bn"
  top: "st/conv2/3x3/bn"
}
layer {
  name: "st/pool2/3x3_s2"
  type: "Pooling"
  bottom: "st/conv2/3x3/bn"
  top: "st/pool2/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "st/inception_3a/1x1"
  type: "Convolution"
  bottom: "st/pool2/3x3_s2"
  top: "st/inception_3a/1x1"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_3a/1x1/bn"
  type: "BN"
  bottom: "st/inception_3a/1x1"
  top: "st/inception_3a/1x1/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_3a/relu_1x1"
  type: "ReLU"
  bottom: "st/inception_3a/1x1/bn"
  top: "st/inception_3a/1x1/bn"
}
layer {
  name: "st/inception_3a/3x3_reduce"
  type: "Convolution"
  bottom: "st/pool2/3x3_s2"
  top: "st/inception_3a/3x3_reduce"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_3a/3x3_reduce/bn"
  type: "BN"
  bottom: "st/inception_3a/3x3_reduce"
  top: "st/inception_3a/3x3_reduce/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_3a/relu_3x3_reduce"
  type: "ReLU"
  bottom: "st/inception_3a/3x3_reduce/bn"
  top: "st/inception_3a/3x3_reduce/bn"
}
layer {
  name: "st/inception_3a/3x3"
  type: "Convolution"
  bottom: "st/inception_3a/3x3_reduce/bn"
  top: "st/inception_3a/3x3"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_3a/3x3/bn"
  type: "BN"
  bottom: "st/inception_3a/3x3"
  top: "st/inception_3a/3x3/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_3a/relu_3x3"
  type: "ReLU"
  bottom: "st/inception_3a/3x3/bn"
  top: "st/inception_3a/3x3/bn"
}
layer {
  name: "st/inception_3a/double3x3_reduce"
  type: "Convolution"
  bottom: "st/pool2/3x3_s2"
  top: "st/inception_3a/double3x3_reduce"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_3a/double3x3_reduce/bn"
  type: "BN"
  bottom: "st/inception_3a/double3x3_reduce"
  top: "st/inception_3a/double3x3_reduce/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_3a/relu_double3x3_reduce"
  type: "ReLU"
  bottom: "st/inception_3a/double3x3_reduce/bn"
  top: "st/inception_3a/double3x3_reduce/bn"
}
layer {
  name: "st/inception_3a/double3x3a"
  type: "Convolution"
  bottom: "st/inception_3a/double3x3_reduce/bn"
  top: "st/inception_3a/double3x3a"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_3a/double3x3a/bn"
  type: "BN"
  bottom: "st/inception_3a/double3x3a"
  top: "st/inception_3a/double3x3a/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_3a/relu_double3x3a"
  type: "ReLU"
  bottom: "st/inception_3a/double3x3a/bn"
  top: "st/inception_3a/double3x3a/bn"
}
layer {
  name: "st/inception_3a/double3x3b"
  type: "Convolution"
  bottom: "st/inception_3a/double3x3a/bn"
  top: "st/inception_3a/double3x3b"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_3a/double3x3b/bn"
  type: "BN"
  bottom: "st/inception_3a/double3x3b"
  top: "st/inception_3a/double3x3b/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_3a/relu_double3x3b"
  type: "ReLU"
  bottom: "st/inception_3a/double3x3b/bn"
  top: "st/inception_3a/double3x3b/bn"
}
layer {
  name: "st/inception_3a/pool"
  type: "Pooling"
  bottom: "st/pool2/3x3_s2"
  top: "st/inception_3a/pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "st/inception_3a/pool_proj"
  type: "Convolution"
  bottom: "st/inception_3a/pool"
  top: "st/inception_3a/pool_proj"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_3a/pool_proj/bn"
  type: "BN"
  bottom: "st/inception_3a/pool_proj"
  top: "st/inception_3a/pool_proj/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_3a/relu_pool_proj"
  type: "ReLU"
  bottom: "st/inception_3a/pool_proj/bn"
  top: "st/inception_3a/pool_proj/bn"
}
layer {
  name: "st/inception_3a/output"
  type: "Concat"
  bottom: "st/inception_3a/1x1/bn"
  bottom: "st/inception_3a/3x3/bn"
  bottom: "st/inception_3a/double3x3b/bn"
  bottom: "st/inception_3a/pool_proj/bn"
  top: "st/inception_3a/output"
}
layer {
  name: "st/inception_3b/1x1"
  type: "Convolution"
  bottom: "st/inception_3a/output"
  top: "st/inception_3b/1x1"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_3b/1x1/bn"
  type: "BN"
  bottom: "st/inception_3b/1x1"
  top: "st/inception_3b/1x1/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_3b/relu_1x1"
  type: "ReLU"
  bottom: "st/inception_3b/1x1/bn"
  top: "st/inception_3b/1x1/bn"
}
layer {
  name: "st/inception_3b/3x3_reduce"
  type: "Convolution"
  bottom: "st/inception_3a/output"
  top: "st/inception_3b/3x3_reduce"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_3b/3x3_reduce/bn"
  type: "BN"
  bottom: "st/inception_3b/3x3_reduce"
  top: "st/inception_3b/3x3_reduce/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_3b/relu_3x3_reduce"
  type: "ReLU"
  bottom: "st/inception_3b/3x3_reduce/bn"
  top: "st/inception_3b/3x3_reduce/bn"
}
layer {
  name: "st/inception_3b/3x3"
  type: "Convolution"
  bottom: "st/inception_3b/3x3_reduce/bn"
  top: "st/inception_3b/3x3"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_3b/3x3/bn"
  type: "BN"
  bottom: "st/inception_3b/3x3"
  top: "st/inception_3b/3x3/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_3b/relu_3x3"
  type: "ReLU"
  bottom: "st/inception_3b/3x3/bn"
  top: "st/inception_3b/3x3/bn"
}
layer {
  name: "st/inception_3b/double3x3_reduce"
  type: "Convolution"
  bottom: "st/inception_3a/output"
  top: "st/inception_3b/double3x3_reduce"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_3b/double3x3_reduce/bn"
  type: "BN"
  bottom: "st/inception_3b/double3x3_reduce"
  top: "st/inception_3b/double3x3_reduce/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_3b/relu_double3x3_reduce"
  type: "ReLU"
  bottom: "st/inception_3b/double3x3_reduce/bn"
  top: "st/inception_3b/double3x3_reduce/bn"
}
layer {
  name: "st/inception_3b/double3x3a"
  type: "Convolution"
  bottom: "st/inception_3b/double3x3_reduce/bn"
  top: "st/inception_3b/double3x3a"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_3b/double3x3a/bn"
  type: "BN"
  bottom: "st/inception_3b/double3x3a"
  top: "st/inception_3b/double3x3a/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_3b/relu_double3x3a"
  type: "ReLU"
  bottom: "st/inception_3b/double3x3a/bn"
  top: "st/inception_3b/double3x3a/bn"
}
layer {
  name: "st/inception_3b/double3x3b"
  type: "Convolution"
  bottom: "st/inception_3b/double3x3a/bn"
  top: "st/inception_3b/double3x3b"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_3b/double3x3b/bn"
  type: "BN"
  bottom: "st/inception_3b/double3x3b"
  top: "st/inception_3b/double3x3b/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_3b/relu_double3x3b"
  type: "ReLU"
  bottom: "st/inception_3b/double3x3b/bn"
  top: "st/inception_3b/double3x3b/bn"
}
layer {
  name: "st/inception_3b/pool"
  type: "Pooling"
  bottom: "st/inception_3a/output"
  top: "st/inception_3b/pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "st/inception_3b/pool_proj"
  type: "Convolution"
  bottom: "st/inception_3b/pool"
  top: "st/inception_3b/pool_proj"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_3b/pool_proj/bn"
  type: "BN"
  bottom: "st/inception_3b/pool_proj"
  top: "st/inception_3b/pool_proj/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_3b/relu_pool_proj"
  type: "ReLU"
  bottom: "st/inception_3b/pool_proj/bn"
  top: "st/inception_3b/pool_proj/bn"
}
layer {
  name: "st/inception_3b/output"
  type: "Concat"
  bottom: "st/inception_3b/1x1/bn"
  bottom: "st/inception_3b/3x3/bn"
  bottom: "st/inception_3b/double3x3b/bn"
  bottom: "st/inception_3b/pool_proj/bn"
  top: "st/inception_3b/output"
}
layer {
  name: "st/inception_3c/3x3_reduce"
  type: "Convolution"
  bottom: "st/inception_3b/output"
  top: "st/inception_3c/3x3_reduce"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_3c/3x3_reduce/bn"
  type: "BN"
  bottom: "st/inception_3c/3x3_reduce"
  top: "st/inception_3c/3x3_reduce/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_3c/relu_3x3_reduce"
  type: "ReLU"
  bottom: "st/inception_3c/3x3_reduce/bn"
  top: "st/inception_3c/3x3_reduce/bn"
}
layer {
  name: "st/inception_3c/3x3"
  type: "Convolution"
  bottom: "st/inception_3c/3x3_reduce/bn"
  top: "st/inception_3c/3x3"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 160
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_3c/3x3/bn"
  type: "BN"
  bottom: "st/inception_3c/3x3"
  top: "st/inception_3c/3x3/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_3c/relu_3x3"
  type: "ReLU"
  bottom: "st/inception_3c/3x3/bn"
  top: "st/inception_3c/3x3/bn"
}
layer {
  name: "st/inception_3c/double3x3_reduce"
  type: "Convolution"
  bottom: "st/inception_3b/output"
  top: "st/inception_3c/double3x3_reduce"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_3c/double3x3_reduce/bn"
  type: "BN"
  bottom: "st/inception_3c/double3x3_reduce"
  top: "st/inception_3c/double3x3_reduce/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_3c/relu_double3x3_reduce"
  type: "ReLU"
  bottom: "st/inception_3c/double3x3_reduce/bn"
  top: "st/inception_3c/double3x3_reduce/bn"
}
layer {
  name: "st/inception_3c/double3x3a"
  type: "Convolution"
  bottom: "st/inception_3c/double3x3_reduce/bn"
  top: "st/inception_3c/double3x3a"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_3c/double3x3a/bn"
  type: "BN"
  bottom: "st/inception_3c/double3x3a"
  top: "st/inception_3c/double3x3a/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_3c/relu_double3x3a"
  type: "ReLU"
  bottom: "st/inception_3c/double3x3a/bn"
  top: "st/inception_3c/double3x3a/bn"
}
layer {
  name: "st/inception_3c/double3x3b"
  type: "Convolution"
  bottom: "st/inception_3c/double3x3a/bn"
  top: "st/inception_3c/double3x3b"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_3c/double3x3b/bn"
  type: "BN"
  bottom: "st/inception_3c/double3x3b"
  top: "st/inception_3c/double3x3b/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_3c/relu_double3x3b"
  type: "ReLU"
  bottom: "st/inception_3c/double3x3b/bn"
  top: "st/inception_3c/double3x3b/bn"
}
layer {
  name: "st/inception_3c/pool/3x3_s2"
  type: "Pooling"
  bottom: "st/inception_3b/output"
  top: "st/inception_3c/pool/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "st/inception_3c/output"
  type: "Concat"
  bottom: "st/inception_3c/3x3/bn"
  bottom: "st/inception_3c/double3x3b/bn"
  bottom: "st/inception_3c/pool/3x3_s2"
  top: "st/inception_3c/output"
}
layer {
  name: "st/inception_4a/1x1"
  type: "Convolution"
  bottom: "st/inception_3c/output"
  top: "st/inception_4a/1x1"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 224
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4a/1x1/bn"
  type: "BN"
  bottom: "st/inception_4a/1x1"
  top: "st/inception_4a/1x1/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4a/relu_1x1"
  type: "ReLU"
  bottom: "st/inception_4a/1x1/bn"
  top: "st/inception_4a/1x1/bn"
}
layer {
  name: "st/inception_4a/3x3_reduce"
  type: "Convolution"
  bottom: "st/inception_3c/output"
  top: "st/inception_4a/3x3_reduce"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4a/3x3_reduce/bn"
  type: "BN"
  bottom: "st/inception_4a/3x3_reduce"
  top: "st/inception_4a/3x3_reduce/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4a/relu_3x3_reduce"
  type: "ReLU"
  bottom: "st/inception_4a/3x3_reduce/bn"
  top: "st/inception_4a/3x3_reduce/bn"
}
layer {
  name: "st/inception_4a/3x3"
  type: "Convolution"
  bottom: "st/inception_4a/3x3_reduce/bn"
  top: "st/inception_4a/3x3"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4a/3x3/bn"
  type: "BN"
  bottom: "st/inception_4a/3x3"
  top: "st/inception_4a/3x3/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4a/relu_3x3"
  type: "ReLU"
  bottom: "st/inception_4a/3x3/bn"
  top: "st/inception_4a/3x3/bn"
}
layer {
  name: "st/inception_4a/double3x3_reduce"
  type: "Convolution"
  bottom: "st/inception_3c/output"
  top: "st/inception_4a/double3x3_reduce"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4a/double3x3_reduce/bn"
  type: "BN"
  bottom: "st/inception_4a/double3x3_reduce"
  top: "st/inception_4a/double3x3_reduce/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4a/relu_double3x3_reduce"
  type: "ReLU"
  bottom: "st/inception_4a/double3x3_reduce/bn"
  top: "st/inception_4a/double3x3_reduce/bn"
}
layer {
  name: "st/inception_4a/double3x3a"
  type: "Convolution"
  bottom: "st/inception_4a/double3x3_reduce/bn"
  top: "st/inception_4a/double3x3a"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4a/double3x3a/bn"
  type: "BN"
  bottom: "st/inception_4a/double3x3a"
  top: "st/inception_4a/double3x3a/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4a/relu_double3x3a"
  type: "ReLU"
  bottom: "st/inception_4a/double3x3a/bn"
  top: "st/inception_4a/double3x3a/bn"
}
layer {
  name: "st/inception_4a/double3x3b"
  type: "Convolution"
  bottom: "st/inception_4a/double3x3a/bn"
  top: "st/inception_4a/double3x3b"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4a/double3x3b/bn"
  type: "BN"
  bottom: "st/inception_4a/double3x3b"
  top: "st/inception_4a/double3x3b/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4a/relu_double3x3b"
  type: "ReLU"
  bottom: "st/inception_4a/double3x3b/bn"
  top: "st/inception_4a/double3x3b/bn"
}
layer {
  name: "st/inception_4a/pool"
  type: "Pooling"
  bottom: "st/inception_3c/output"
  top: "st/inception_4a/pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "st/inception_4a/pool_proj"
  type: "Convolution"
  bottom: "st/inception_4a/pool"
  top: "st/inception_4a/pool_proj"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4a/pool_proj/bn"
  type: "BN"
  bottom: "st/inception_4a/pool_proj"
  top: "st/inception_4a/pool_proj/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4a/relu_pool_proj"
  type: "ReLU"
  bottom: "st/inception_4a/pool_proj/bn"
  top: "st/inception_4a/pool_proj/bn"
}
layer {
  name: "st/inception_4a/output"
  type: "Concat"
  bottom: "st/inception_4a/1x1/bn"
  bottom: "st/inception_4a/3x3/bn"
  bottom: "st/inception_4a/double3x3b/bn"
  bottom: "st/inception_4a/pool_proj/bn"
  top: "st/inception_4a/output"
}
layer {
  name: "st/inception_4b/1x1"
  type: "Convolution"
  bottom: "st/inception_4a/output"
  top: "st/inception_4b/1x1"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 192
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4b/1x1/bn"
  type: "BN"
  bottom: "st/inception_4b/1x1"
  top: "st/inception_4b/1x1/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4b/relu_1x1"
  type: "ReLU"
  bottom: "st/inception_4b/1x1/bn"
  top: "st/inception_4b/1x1/bn"
}
layer {
  name: "st/inception_4b/3x3_reduce"
  type: "Convolution"
  bottom: "st/inception_4a/output"
  top: "st/inception_4b/3x3_reduce"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4b/3x3_reduce/bn"
  type: "BN"
  bottom: "st/inception_4b/3x3_reduce"
  top: "st/inception_4b/3x3_reduce/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4b/relu_3x3_reduce"
  type: "ReLU"
  bottom: "st/inception_4b/3x3_reduce/bn"
  top: "st/inception_4b/3x3_reduce/bn"
}
layer {
  name: "st/inception_4b/3x3"
  type: "Convolution"
  bottom: "st/inception_4b/3x3_reduce/bn"
  top: "st/inception_4b/3x3"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4b/3x3/bn"
  type: "BN"
  bottom: "st/inception_4b/3x3"
  top: "st/inception_4b/3x3/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4b/relu_3x3"
  type: "ReLU"
  bottom: "st/inception_4b/3x3/bn"
  top: "st/inception_4b/3x3/bn"
}
layer {
  name: "st/inception_4b/double3x3_reduce"
  type: "Convolution"
  bottom: "st/inception_4a/output"
  top: "st/inception_4b/double3x3_reduce"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4b/double3x3_reduce/bn"
  type: "BN"
  bottom: "st/inception_4b/double3x3_reduce"
  top: "st/inception_4b/double3x3_reduce/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4b/relu_double3x3_reduce"
  type: "ReLU"
  bottom: "st/inception_4b/double3x3_reduce/bn"
  top: "st/inception_4b/double3x3_reduce/bn"
}
layer {
  name: "st/inception_4b/double3x3a"
  type: "Convolution"
  bottom: "st/inception_4b/double3x3_reduce/bn"
  top: "st/inception_4b/double3x3a"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4b/double3x3a/bn"
  type: "BN"
  bottom: "st/inception_4b/double3x3a"
  top: "st/inception_4b/double3x3a/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4b/relu_double3x3a"
  type: "ReLU"
  bottom: "st/inception_4b/double3x3a/bn"
  top: "st/inception_4b/double3x3a/bn"
}
layer {
  name: "st/inception_4b/double3x3b"
  type: "Convolution"
  bottom: "st/inception_4b/double3x3a/bn"
  top: "st/inception_4b/double3x3b"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4b/double3x3b/bn"
  type: "BN"
  bottom: "st/inception_4b/double3x3b"
  top: "st/inception_4b/double3x3b/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4b/relu_double3x3b"
  type: "ReLU"
  bottom: "st/inception_4b/double3x3b/bn"
  top: "st/inception_4b/double3x3b/bn"
}
layer {
  name: "st/inception_4b/pool"
  type: "Pooling"
  bottom: "st/inception_4a/output"
  top: "st/inception_4b/pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "st/inception_4b/pool_proj"
  type: "Convolution"
  bottom: "st/inception_4b/pool"
  top: "st/inception_4b/pool_proj"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4b/pool_proj/bn"
  type: "BN"
  bottom: "st/inception_4b/pool_proj"
  top: "st/inception_4b/pool_proj/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4b/relu_pool_proj"
  type: "ReLU"
  bottom: "st/inception_4b/pool_proj/bn"
  top: "st/inception_4b/pool_proj/bn"
}
layer {
  name: "st/inception_4b/output"
  type: "Concat"
  bottom: "st/inception_4b/1x1/bn"
  bottom: "st/inception_4b/3x3/bn"
  bottom: "st/inception_4b/double3x3b/bn"
  bottom: "st/inception_4b/pool_proj/bn"
  top: "st/inception_4b/output"
}
layer {
  name: "st/inception_4c/1x1"
  type: "Convolution"
  bottom: "st/inception_4b/output"
  top: "st/inception_4c/1x1"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 160
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4c/1x1/bn"
  type: "BN"
  bottom: "st/inception_4c/1x1"
  top: "st/inception_4c/1x1/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4c/relu_1x1"
  type: "ReLU"
  bottom: "st/inception_4c/1x1/bn"
  top: "st/inception_4c/1x1/bn"
}
layer {
  name: "st/inception_4c/3x3_reduce"
  type: "Convolution"
  bottom: "st/inception_4b/output"
  top: "st/inception_4c/3x3_reduce"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4c/3x3_reduce/bn"
  type: "BN"
  bottom: "st/inception_4c/3x3_reduce"
  top: "st/inception_4c/3x3_reduce/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4c/relu_3x3_reduce"
  type: "ReLU"
  bottom: "st/inception_4c/3x3_reduce/bn"
  top: "st/inception_4c/3x3_reduce/bn"
}
layer {
  name: "st/inception_4c/3x3"
  type: "Convolution"
  bottom: "st/inception_4c/3x3_reduce/bn"
  top: "st/inception_4c/3x3"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 160
    bias_term: false
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4c/3x3/bn"
  type: "BN"
  bottom: "st/inception_4c/3x3"
  top: "st/inception_4c/3x3/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4c/relu_3x3"
  type: "ReLU"
  bottom: "st/inception_4c/3x3/bn"
  top: "st/inception_4c/3x3/bn"
}
layer {
  name: "st/inception_4c/double3x3_reduce"
  type: "Convolution"
  bottom: "st/inception_4b/output"
  top: "st/inception_4c/double3x3_reduce"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4c/double3x3_reduce/bn"
  type: "BN"
  bottom: "st/inception_4c/double3x3_reduce"
  top: "st/inception_4c/double3x3_reduce/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4c/relu_double3x3_reduce"
  type: "ReLU"
  bottom: "st/inception_4c/double3x3_reduce/bn"
  top: "st/inception_4c/double3x3_reduce/bn"
}
layer {
  name: "st/inception_4c/double3x3a"
  type: "Convolution"
  bottom: "st/inception_4c/double3x3_reduce/bn"
  top: "st/inception_4c/double3x3a"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 160
    bias_term: false
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4c/double3x3a/bn"
  type: "BN"
  bottom: "st/inception_4c/double3x3a"
  top: "st/inception_4c/double3x3a/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4c/relu_double3x3a"
  type: "ReLU"
  bottom: "st/inception_4c/double3x3a/bn"
  top: "st/inception_4c/double3x3a/bn"
}
layer {
  name: "st/inception_4c/double3x3b"
  type: "Convolution"
  bottom: "st/inception_4c/double3x3a/bn"
  top: "st/inception_4c/double3x3b"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 160
    bias_term: false
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4c/double3x3b/bn"
  type: "BN"
  bottom: "st/inception_4c/double3x3b"
  top: "st/inception_4c/double3x3b/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4c/relu_double3x3b"
  type: "ReLU"
  bottom: "st/inception_4c/double3x3b/bn"
  top: "st/inception_4c/double3x3b/bn"
}
layer {
  name: "st/inception_4c/pool"
  type: "Pooling"
  bottom: "st/inception_4b/output"
  top: "st/inception_4c/pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "st/inception_4c/pool_proj"
  type: "Convolution"
  bottom: "st/inception_4c/pool"
  top: "st/inception_4c/pool_proj"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4c/pool_proj/bn"
  type: "BN"
  bottom: "st/inception_4c/pool_proj"
  top: "st/inception_4c/pool_proj/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4c/relu_pool_proj"
  type: "ReLU"
  bottom: "st/inception_4c/pool_proj/bn"
  top: "st/inception_4c/pool_proj/bn"
}
layer {
  name: "st/inception_4c/output"
  type: "Concat"
  bottom: "st/inception_4c/1x1/bn"
  bottom: "st/inception_4c/3x3/bn"
  bottom: "st/inception_4c/double3x3b/bn"
  bottom: "st/inception_4c/pool_proj/bn"
  top: "st/inception_4c/output"
}
layer {
  name: "st/inception_4d/1x1"
  type: "Convolution"
  bottom: "st/inception_4c/output"
  top: "st/inception_4d/1x1"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4d/1x1/bn"
  type: "BN"
  bottom: "st/inception_4d/1x1"
  top: "st/inception_4d/1x1/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4d/relu_1x1"
  type: "ReLU"
  bottom: "st/inception_4d/1x1/bn"
  top: "st/inception_4d/1x1/bn"
}
layer {
  name: "st/inception_4d/3x3_reduce"
  type: "Convolution"
  bottom: "st/inception_4c/output"
  top: "st/inception_4d/3x3_reduce"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4d/3x3_reduce/bn"
  type: "BN"
  bottom: "st/inception_4d/3x3_reduce"
  top: "st/inception_4d/3x3_reduce/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4d/relu_3x3_reduce"
  type: "ReLU"
  bottom: "st/inception_4d/3x3_reduce/bn"
  top: "st/inception_4d/3x3_reduce/bn"
}
layer {
  name: "st/inception_4d/3x3"
  type: "Convolution"
  bottom: "st/inception_4d/3x3_reduce/bn"
  top: "st/inception_4d/3x3"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4d/3x3/bn"
  type: "BN"
  bottom: "st/inception_4d/3x3"
  top: "st/inception_4d/3x3/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4d/relu_3x3"
  type: "ReLU"
  bottom: "st/inception_4d/3x3/bn"
  top: "st/inception_4d/3x3/bn"
}
layer {
  name: "st/inception_4d/double3x3_reduce"
  type: "Convolution"
  bottom: "st/inception_4c/output"
  top: "st/inception_4d/double3x3_reduce"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 160
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4d/double3x3_reduce/bn"
  type: "BN"
  bottom: "st/inception_4d/double3x3_reduce"
  top: "st/inception_4d/double3x3_reduce/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4d/relu_double3x3_reduce"
  type: "ReLU"
  bottom: "st/inception_4d/double3x3_reduce/bn"
  top: "st/inception_4d/double3x3_reduce/bn"
}
layer {
  name: "st/inception_4d/double3x3a"
  type: "Convolution"
  bottom: "st/inception_4d/double3x3_reduce/bn"
  top: "st/inception_4d/double3x3a"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4d/double3x3a/bn"
  type: "BN"
  bottom: "st/inception_4d/double3x3a"
  top: "st/inception_4d/double3x3a/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4d/relu_double3x3a"
  type: "ReLU"
  bottom: "st/inception_4d/double3x3a/bn"
  top: "st/inception_4d/double3x3a/bn"
}
layer {
  name: "st/inception_4d/double3x3b"
  type: "Convolution"
  bottom: "st/inception_4d/double3x3a/bn"
  top: "st/inception_4d/double3x3b"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4d/double3x3b/bn"
  type: "BN"
  bottom: "st/inception_4d/double3x3b"
  top: "st/inception_4d/double3x3b/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4d/relu_double3x3b"
  type: "ReLU"
  bottom: "st/inception_4d/double3x3b/bn"
  top: "st/inception_4d/double3x3b/bn"
}
layer {
  name: "st/inception_4d/pool"
  type: "Pooling"
  bottom: "st/inception_4c/output"
  top: "st/inception_4d/pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "st/inception_4d/pool_proj"
  type: "Convolution"
  bottom: "st/inception_4d/pool"
  top: "st/inception_4d/pool_proj"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4d/pool_proj/bn"
  type: "BN"
  bottom: "st/inception_4d/pool_proj"
  top: "st/inception_4d/pool_proj/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4d/relu_pool_proj"
  type: "ReLU"
  bottom: "st/inception_4d/pool_proj/bn"
  top: "st/inception_4d/pool_proj/bn"
}
layer {
  name: "st/inception_4d/output"
  type: "Concat"
  bottom: "st/inception_4d/1x1/bn"
  bottom: "st/inception_4d/3x3/bn"
  bottom: "st/inception_4d/double3x3b/bn"
  bottom: "st/inception_4d/pool_proj/bn"
  top: "st/inception_4d/output"
}
layer {
  name: "st/inception_4e/3x3_reduce"
  type: "Convolution"
  bottom: "st/inception_4d/output"
  top: "st/inception_4e/3x3_reduce"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4e/3x3_reduce/bn"
  type: "BN"
  bottom: "st/inception_4e/3x3_reduce"
  top: "st/inception_4e/3x3_reduce/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4e/relu_3x3_reduce"
  type: "ReLU"
  bottom: "st/inception_4e/3x3_reduce/bn"
  top: "st/inception_4e/3x3_reduce/bn"
}
layer {
  name: "st/inception_4e/3x3"
  type: "Convolution"
  bottom: "st/inception_4e/3x3_reduce/bn"
  top: "st/inception_4e/3x3"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4e/3x3/bn"
  type: "BN"
  bottom: "st/inception_4e/3x3"
  top: "st/inception_4e/3x3/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4e/relu_3x3"
  type: "ReLU"
  bottom: "st/inception_4e/3x3/bn"
  top: "st/inception_4e/3x3/bn"
}
layer {
  name: "st/inception_4e/double3x3_reduce"
  type: "Convolution"
  bottom: "st/inception_4d/output"
  top: "st/inception_4e/double3x3_reduce"
  param {
    lr_mult: 0.0001
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 192
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "st/inception_4e/double3x3_reduce/bn"
  type: "BN"
  bottom: "st/inception_4e/double3x3_reduce"
  top: "st/inception_4e/double3x3_reduce/bn"
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0001
    decay_mult: 0.0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "st/inception_4e/relu_double3x3_reduce"
  type: "ReLU"
  bottom: "st/inception_4e/double3x3_reduce/bn"
