name: "CUB_GoogleNet_ST"
layer {
  name: "data"
  type: "ImageData"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 448
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  image_data_param {
    source: "data/CUB_200_2011/train_files.txt"
    batch_size: 16
    shuffle: true
    new_height: 512
    new_width: 512
  }
}
layer {
  name: "data"
  type: "ImageData"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 448
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  image_data_param {
    source: "data/CUB_200_2011/test_files.txt"
    batch_size: 16
    new_height: 512
    new_width: 512
  }
}
layer {
  name: "downsample"
  type: "Pooling"
  bottom: "data"
  top: "downsampled_data"
  pooling_param {
    pool: AVE
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "st/conv1/7x7_s2"
  type: "Convolution"
  bottom: "downsampled_data"
  top: "st/conv1/7x7_s2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/conv1/relu_7x7"
  type: "ReLU"
  bottom: "st/conv1/7x7_s2"
  top: "st/conv1/7x7_s2"
}
layer {
  name: "st/pool1/3x3_s2"
  type: "Pooling"
  bottom: "st/conv1/7x7_s2"
  top: "st/pool1/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "st/pool1/norm1"
  type: "LRN"
  bottom: "st/pool1/3x3_s2"
  top: "st/pool1/norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "st/conv2/3x3_reduce"
  type: "Convolution"
  bottom: "st/pool1/norm1"
  top: "st/conv2/3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/conv2/relu_3x3_reduce"
  type: "ReLU"
  bottom: "st/conv2/3x3_reduce"
  top: "st/conv2/3x3_reduce"
}
layer {
  name: "st/conv2/3x3"
  type: "Convolution"
  bottom: "st/conv2/3x3_reduce"
  top: "st/conv2/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/conv2/relu_3x3"
  type: "ReLU"
  bottom: "st/conv2/3x3"
  top: "st/conv2/3x3"
}
layer {
  name: "st/conv2/norm2"
  type: "LRN"
  bottom: "st/conv2/3x3"
  top: "st/conv2/norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "st/pool2/3x3_s2"
  type: "Pooling"
  bottom: "st/conv2/norm2"
  top: "st/pool2/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "st/inception_3a/1x1"
  type: "Convolution"
  bottom: "st/pool2/3x3_s2"
  top: "st/inception_3a/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_3a/relu_1x1"
  type: "ReLU"
  bottom: "st/inception_3a/1x1"
  top: "st/inception_3a/1x1"
}
layer {
  name: "st/inception_3a/3x3_reduce"
  type: "Convolution"
  bottom: "st/pool2/3x3_s2"
  top: "st/inception_3a/3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_3a/relu_3x3_reduce"
  type: "ReLU"
  bottom: "st/inception_3a/3x3_reduce"
  top: "st/inception_3a/3x3_reduce"
}
layer {
  name: "st/inception_3a/3x3"
  type: "Convolution"
  bottom: "st/inception_3a/3x3_reduce"
  top: "st/inception_3a/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_3a/relu_3x3"
  type: "ReLU"
  bottom: "st/inception_3a/3x3"
  top: "st/inception_3a/3x3"
}
layer {
  name: "st/inception_3a/5x5_reduce"
  type: "Convolution"
  bottom: "st/pool2/3x3_s2"
  top: "st/inception_3a/5x5_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_3a/relu_5x5_reduce"
  type: "ReLU"
  bottom: "st/inception_3a/5x5_reduce"
  top: "st/inception_3a/5x5_reduce"
}
layer {
  name: "st/inception_3a/5x5"
  type: "Convolution"
  bottom: "st/inception_3a/5x5_reduce"
  top: "st/inception_3a/5x5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_3a/relu_5x5"
  type: "ReLU"
  bottom: "st/inception_3a/5x5"
  top: "st/inception_3a/5x5"
}
layer {
  name: "st/inception_3a/pool"
  type: "Pooling"
  bottom: "st/pool2/3x3_s2"
  top: "st/inception_3a/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "st/inception_3a/pool_proj"
  type: "Convolution"
  bottom: "st/inception_3a/pool"
  top: "st/inception_3a/pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_3a/relu_pool_proj"
  type: "ReLU"
  bottom: "st/inception_3a/pool_proj"
  top: "st/inception_3a/pool_proj"
}
layer {
  name: "st/inception_3a/output"
  type: "Concat"
  bottom: "st/inception_3a/1x1"
  bottom: "st/inception_3a/3x3"
  bottom: "st/inception_3a/5x5"
  bottom: "st/inception_3a/pool_proj"
  top: "st/inception_3a/output"
}
layer {
  name: "st/inception_3b/1x1"
  type: "Convolution"
  bottom: "st/inception_3a/output"
  top: "st/inception_3b/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_3b/relu_1x1"
  type: "ReLU"
  bottom: "st/inception_3b/1x1"
  top: "st/inception_3b/1x1"
}
layer {
  name: "st/inception_3b/3x3_reduce"
  type: "Convolution"
  bottom: "st/inception_3a/output"
  top: "st/inception_3b/3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_3b/relu_3x3_reduce"
  type: "ReLU"
  bottom: "st/inception_3b/3x3_reduce"
  top: "st/inception_3b/3x3_reduce"
}
layer {
  name: "st/inception_3b/3x3"
  type: "Convolution"
  bottom: "st/inception_3b/3x3_reduce"
  top: "st/inception_3b/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_3b/relu_3x3"
  type: "ReLU"
  bottom: "st/inception_3b/3x3"
  top: "st/inception_3b/3x3"
}
layer {
  name: "st/inception_3b/5x5_reduce"
  type: "Convolution"
  bottom: "st/inception_3a/output"
  top: "st/inception_3b/5x5_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_3b/relu_5x5_reduce"
  type: "ReLU"
  bottom: "st/inception_3b/5x5_reduce"
  top: "st/inception_3b/5x5_reduce"
}
layer {
  name: "st/inception_3b/5x5"
  type: "Convolution"
  bottom: "st/inception_3b/5x5_reduce"
  top: "st/inception_3b/5x5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_3b/relu_5x5"
  type: "ReLU"
  bottom: "st/inception_3b/5x5"
  top: "st/inception_3b/5x5"
}
layer {
  name: "st/inception_3b/pool"
  type: "Pooling"
  bottom: "st/inception_3a/output"
  top: "st/inception_3b/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "st/inception_3b/pool_proj"
  type: "Convolution"
  bottom: "st/inception_3b/pool"
  top: "st/inception_3b/pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_3b/relu_pool_proj"
  type: "ReLU"
  bottom: "st/inception_3b/pool_proj"
  top: "st/inception_3b/pool_proj"
}
layer {
  name: "st/inception_3b/output"
  type: "Concat"
  bottom: "st/inception_3b/1x1"
  bottom: "st/inception_3b/3x3"
  bottom: "st/inception_3b/5x5"
  bottom: "st/inception_3b/pool_proj"
  top: "st/inception_3b/output"
}
layer {
  name: "st/pool3/3x3_s2"
  type: "Pooling"
  bottom: "st/inception_3b/output"
  top: "st/pool3/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "st/inception_4a/1x1"
  type: "Convolution"
  bottom: "st/pool3/3x3_s2"
  top: "st/inception_4a/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4a/relu_1x1"
  type: "ReLU"
  bottom: "st/inception_4a/1x1"
  top: "st/inception_4a/1x1"
}
layer {
  name: "st/inception_4a/3x3_reduce"
  type: "Convolution"
  bottom: "st/pool3/3x3_s2"
  top: "st/inception_4a/3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4a/relu_3x3_reduce"
  type: "ReLU"
  bottom: "st/inception_4a/3x3_reduce"
  top: "st/inception_4a/3x3_reduce"
}
layer {
  name: "st/inception_4a/3x3"
  type: "Convolution"
  bottom: "st/inception_4a/3x3_reduce"
  top: "st/inception_4a/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 208
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4a/relu_3x3"
  type: "ReLU"
  bottom: "st/inception_4a/3x3"
  top: "st/inception_4a/3x3"
}
layer {
  name: "st/inception_4a/5x5_reduce"
  type: "Convolution"
  bottom: "st/pool3/3x3_s2"
  top: "st/inception_4a/5x5_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4a/relu_5x5_reduce"
  type: "ReLU"
  bottom: "st/inception_4a/5x5_reduce"
  top: "st/inception_4a/5x5_reduce"
}
layer {
  name: "st/inception_4a/5x5"
  type: "Convolution"
  bottom: "st/inception_4a/5x5_reduce"
  top: "st/inception_4a/5x5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4a/relu_5x5"
  type: "ReLU"
  bottom: "st/inception_4a/5x5"
  top: "st/inception_4a/5x5"
}
layer {
  name: "st/inception_4a/pool"
  type: "Pooling"
  bottom: "st/pool3/3x3_s2"
  top: "st/inception_4a/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "st/inception_4a/pool_proj"
  type: "Convolution"
  bottom: "st/inception_4a/pool"
  top: "st/inception_4a/pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4a/relu_pool_proj"
  type: "ReLU"
  bottom: "st/inception_4a/pool_proj"
  top: "st/inception_4a/pool_proj"
}
layer {
  name: "st/inception_4a/output"
  type: "Concat"
  bottom: "st/inception_4a/1x1"
  bottom: "st/inception_4a/3x3"
  bottom: "st/inception_4a/5x5"
  bottom: "st/inception_4a/pool_proj"
  top: "st/inception_4a/output"
}
layer {
  name: "st/inception_4b/1x1"
  type: "Convolution"
  bottom: "st/inception_4a/output"
  top: "st/inception_4b/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4b/relu_1x1"
  type: "ReLU"
  bottom: "st/inception_4b/1x1"
  top: "st/inception_4b/1x1"
}
layer {
  name: "st/inception_4b/3x3_reduce"
  type: "Convolution"
  bottom: "st/inception_4a/output"
  top: "st/inception_4b/3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 112
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4b/relu_3x3_reduce"
  type: "ReLU"
  bottom: "st/inception_4b/3x3_reduce"
  top: "st/inception_4b/3x3_reduce"
}
layer {
  name: "st/inception_4b/3x3"
  type: "Convolution"
  bottom: "st/inception_4b/3x3_reduce"
  top: "st/inception_4b/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 224
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4b/relu_3x3"
  type: "ReLU"
  bottom: "st/inception_4b/3x3"
  top: "st/inception_4b/3x3"
}
layer {
  name: "st/inception_4b/5x5_reduce"
  type: "Convolution"
  bottom: "st/inception_4a/output"
  top: "st/inception_4b/5x5_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 24
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4b/relu_5x5_reduce"
  type: "ReLU"
  bottom: "st/inception_4b/5x5_reduce"
  top: "st/inception_4b/5x5_reduce"
}
layer {
  name: "st/inception_4b/5x5"
  type: "Convolution"
  bottom: "st/inception_4b/5x5_reduce"
  top: "st/inception_4b/5x5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4b/relu_5x5"
  type: "ReLU"
  bottom: "st/inception_4b/5x5"
  top: "st/inception_4b/5x5"
}
layer {
  name: "st/inception_4b/pool"
  type: "Pooling"
  bottom: "st/inception_4a/output"
  top: "st/inception_4b/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "st/inception_4b/pool_proj"
  type: "Convolution"
  bottom: "st/inception_4b/pool"
  top: "st/inception_4b/pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4b/relu_pool_proj"
  type: "ReLU"
  bottom: "st/inception_4b/pool_proj"
  top: "st/inception_4b/pool_proj"
}
layer {
  name: "st/inception_4b/output"
  type: "Concat"
  bottom: "st/inception_4b/1x1"
  bottom: "st/inception_4b/3x3"
  bottom: "st/inception_4b/5x5"
  bottom: "st/inception_4b/pool_proj"
  top: "st/inception_4b/output"
}
layer {
  name: "st/inception_4c/1x1"
  type: "Convolution"
  bottom: "st/inception_4b/output"
  top: "st/inception_4c/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4c/relu_1x1"
  type: "ReLU"
  bottom: "st/inception_4c/1x1"
  top: "st/inception_4c/1x1"
}
layer {
  name: "st/inception_4c/3x3_reduce"
  type: "Convolution"
  bottom: "st/inception_4b/output"
  top: "st/inception_4c/3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4c/relu_3x3_reduce"
  type: "ReLU"
  bottom: "st/inception_4c/3x3_reduce"
  top: "st/inception_4c/3x3_reduce"
}
layer {
  name: "st/inception_4c/3x3"
  type: "Convolution"
  bottom: "st/inception_4c/3x3_reduce"
  top: "st/inception_4c/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4c/relu_3x3"
  type: "ReLU"
  bottom: "st/inception_4c/3x3"
  top: "st/inception_4c/3x3"
}
layer {
  name: "st/inception_4c/5x5_reduce"
  type: "Convolution"
  bottom: "st/inception_4b/output"
  top: "st/inception_4c/5x5_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 24
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4c/relu_5x5_reduce"
  type: "ReLU"
  bottom: "st/inception_4c/5x5_reduce"
  top: "st/inception_4c/5x5_reduce"
}
layer {
  name: "st/inception_4c/5x5"
  type: "Convolution"
  bottom: "st/inception_4c/5x5_reduce"
  top: "st/inception_4c/5x5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4c/relu_5x5"
  type: "ReLU"
  bottom: "st/inception_4c/5x5"
  top: "st/inception_4c/5x5"
}
layer {
  name: "st/inception_4c/pool"
  type: "Pooling"
  bottom: "st/inception_4b/output"
  top: "st/inception_4c/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "st/inception_4c/pool_proj"
  type: "Convolution"
  bottom: "st/inception_4c/pool"
  top: "st/inception_4c/pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4c/relu_pool_proj"
  type: "ReLU"
  bottom: "st/inception_4c/pool_proj"
  top: "st/inception_4c/pool_proj"
}
layer {
  name: "st/inception_4c/output"
  type: "Concat"
  bottom: "st/inception_4c/1x1"
  bottom: "st/inception_4c/3x3"
  bottom: "st/inception_4c/5x5"
  bottom: "st/inception_4c/pool_proj"
  top: "st/inception_4c/output"
}
layer {
  name: "st/inception_4d/1x1"
  type: "Convolution"
  bottom: "st/inception_4c/output"
  top: "st/inception_4d/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 112
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4d/relu_1x1"
  type: "ReLU"
  bottom: "st/inception_4d/1x1"
  top: "st/inception_4d/1x1"
}
layer {
  name: "st/inception_4d/3x3_reduce"
  type: "Convolution"
  bottom: "st/inception_4c/output"
  top: "st/inception_4d/3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 144
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4d/relu_3x3_reduce"
  type: "ReLU"
  bottom: "st/inception_4d/3x3_reduce"
  top: "st/inception_4d/3x3_reduce"
}
layer {
  name: "st/inception_4d/3x3"
  type: "Convolution"
  bottom: "st/inception_4d/3x3_reduce"
  top: "st/inception_4d/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 288
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4d/relu_3x3"
  type: "ReLU"
  bottom: "st/inception_4d/3x3"
  top: "st/inception_4d/3x3"
}
layer {
  name: "st/inception_4d/5x5_reduce"
  type: "Convolution"
  bottom: "st/inception_4c/output"
  top: "st/inception_4d/5x5_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4d/relu_5x5_reduce"
  type: "ReLU"
  bottom: "st/inception_4d/5x5_reduce"
  top: "st/inception_4d/5x5_reduce"
}
layer {
  name: "st/inception_4d/5x5"
  type: "Convolution"
  bottom: "st/inception_4d/5x5_reduce"
  top: "st/inception_4d/5x5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4d/relu_5x5"
  type: "ReLU"
  bottom: "st/inception_4d/5x5"
  top: "st/inception_4d/5x5"
}
layer {
  name: "st/inception_4d/pool"
  type: "Pooling"
  bottom: "st/inception_4c/output"
  top: "st/inception_4d/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "st/inception_4d/pool_proj"
  type: "Convolution"
  bottom: "st/inception_4d/pool"
  top: "st/inception_4d/pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4d/relu_pool_proj"
  type: "ReLU"
  bottom: "st/inception_4d/pool_proj"
  top: "st/inception_4d/pool_proj"
}
layer {
  name: "st/inception_4d/output"
  type: "Concat"
  bottom: "st/inception_4d/1x1"
  bottom: "st/inception_4d/3x3"
  bottom: "st/inception_4d/5x5"
  bottom: "st/inception_4d/pool_proj"
  top: "st/inception_4d/output"
}
layer {
  name: "st/inception_4e/1x1"
  type: "Convolution"
  bottom: "st/inception_4d/output"
  top: "st/inception_4e/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4e/relu_1x1"
  type: "ReLU"
  bottom: "st/inception_4e/1x1"
  top: "st/inception_4e/1x1"
}
layer {
  name: "st/inception_4e/3x3_reduce"
  type: "Convolution"
  bottom: "st/inception_4d/output"
  top: "st/inception_4e/3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4e/relu_3x3_reduce"
  type: "ReLU"
  bottom: "st/inception_4e/3x3_reduce"
  top: "st/inception_4e/3x3_reduce"
}
layer {
  name: "st/inception_4e/3x3"
  type: "Convolution"
  bottom: "st/inception_4e/3x3_reduce"
  top: "st/inception_4e/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 320
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4e/relu_3x3"
  type: "ReLU"
  bottom: "st/inception_4e/3x3"
  top: "st/inception_4e/3x3"
}
layer {
  name: "st/inception_4e/5x5_reduce"
  type: "Convolution"
  bottom: "st/inception_4d/output"
  top: "st/inception_4e/5x5_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4e/relu_5x5_reduce"
  type: "ReLU"
  bottom: "st/inception_4e/5x5_reduce"
  top: "st/inception_4e/5x5_reduce"
}
layer {
  name: "st/inception_4e/5x5"
  type: "Convolution"
  bottom: "st/inception_4e/5x5_reduce"
  top: "st/inception_4e/5x5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4e/relu_5x5"
  type: "ReLU"
  bottom: "st/inception_4e/5x5"
  top: "st/inception_4e/5x5"
}
layer {
  name: "st/inception_4e/pool"
  type: "Pooling"
  bottom: "st/inception_4d/output"
  top: "st/inception_4e/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "st/inception_4e/pool_proj"
  type: "Convolution"
  bottom: "st/inception_4e/pool"
  top: "st/inception_4e/pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_4e/relu_pool_proj"
  type: "ReLU"
  bottom: "st/inception_4e/pool_proj"
  top: "st/inception_4e/pool_proj"
}
layer {
  name: "st/inception_4e/output"
  type: "Concat"
  bottom: "st/inception_4e/1x1"
  bottom: "st/inception_4e/3x3"
  bottom: "st/inception_4e/5x5"
  bottom: "st/inception_4e/pool_proj"
  top: "st/inception_4e/output"
}
layer {
  name: "st/pool4/3x3_s2"
  type: "Pooling"
  bottom: "st/inception_4e/output"
  top: "st/pool4/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "st/inception_5a/1x1"
  type: "Convolution"
  bottom: "st/pool4/3x3_s2"
  top: "st/inception_5a/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_5a/relu_1x1"
  type: "ReLU"
  bottom: "st/inception_5a/1x1"
  top: "st/inception_5a/1x1"
}
layer {
  name: "st/inception_5a/3x3_reduce"
  type: "Convolution"
  bottom: "st/pool4/3x3_s2"
  top: "st/inception_5a/3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_5a/relu_3x3_reduce"
  type: "ReLU"
  bottom: "st/inception_5a/3x3_reduce"
  top: "st/inception_5a/3x3_reduce"
}
layer {
  name: "st/inception_5a/3x3"
  type: "Convolution"
  bottom: "st/inception_5a/3x3_reduce"
  top: "st/inception_5a/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 320
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_5a/relu_3x3"
  type: "ReLU"
  bottom: "st/inception_5a/3x3"
  top: "st/inception_5a/3x3"
}
layer {
  name: "st/inception_5a/5x5_reduce"
  type: "Convolution"
  bottom: "st/pool4/3x3_s2"
  top: "st/inception_5a/5x5_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_5a/relu_5x5_reduce"
  type: "ReLU"
  bottom: "st/inception_5a/5x5_reduce"
  top: "st/inception_5a/5x5_reduce"
}
layer {
  name: "st/inception_5a/5x5"
  type: "Convolution"
  bottom: "st/inception_5a/5x5_reduce"
  top: "st/inception_5a/5x5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_5a/relu_5x5"
  type: "ReLU"
  bottom: "st/inception_5a/5x5"
  top: "st/inception_5a/5x5"
}
layer {
  name: "st/inception_5a/pool"
  type: "Pooling"
  bottom: "st/pool4/3x3_s2"
  top: "st/inception_5a/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "st/inception_5a/pool_proj"
  type: "Convolution"
  bottom: "st/inception_5a/pool"
  top: "st/inception_5a/pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_5a/relu_pool_proj"
  type: "ReLU"
  bottom: "st/inception_5a/pool_proj"
  top: "st/inception_5a/pool_proj"
}
layer {
  name: "st/inception_5a/output"
  type: "Concat"
  bottom: "st/inception_5a/1x1"
  bottom: "st/inception_5a/3x3"
  bottom: "st/inception_5a/5x5"
  bottom: "st/inception_5a/pool_proj"
  top: "st/inception_5a/output"
}
layer {
  name: "st/inception_5b/1x1"
  type: "Convolution"
  bottom: "st/inception_5a/output"
  top: "st/inception_5b/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_5b/relu_1x1"
  type: "ReLU"
  bottom: "st/inception_5b/1x1"
  top: "st/inception_5b/1x1"
}
layer {
  name: "st/inception_5b/3x3_reduce"
  type: "Convolution"
  bottom: "st/inception_5a/output"
  top: "st/inception_5b/3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_5b/relu_3x3_reduce"
  type: "ReLU"
  bottom: "st/inception_5b/3x3_reduce"
  top: "st/inception_5b/3x3_reduce"
}
layer {
  name: "st/inception_5b/3x3"
  type: "Convolution"
  bottom: "st/inception_5b/3x3_reduce"
  top: "st/inception_5b/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_5b/relu_3x3"
  type: "ReLU"
  bottom: "st/inception_5b/3x3"
  top: "st/inception_5b/3x3"
}
layer {
  name: "st/inception_5b/5x5_reduce"
  type: "Convolution"
  bottom: "st/inception_5a/output"
  top: "st/inception_5b/5x5_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_5b/relu_5x5_reduce"
  type: "ReLU"
  bottom: "st/inception_5b/5x5_reduce"
  top: "st/inception_5b/5x5_reduce"
}
layer {
  name: "st/inception_5b/5x5"
  type: "Convolution"
  bottom: "st/inception_5b/5x5_reduce"
  top: "st/inception_5b/5x5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_5b/relu_5x5"
  type: "ReLU"
  bottom: "st/inception_5b/5x5"
  top: "st/inception_5b/5x5"
}
layer {
  name: "st/inception_5b/pool"
  type: "Pooling"
  bottom: "st/inception_5a/output"
  top: "st/inception_5b/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "st/inception_5b/pool_proj"
  type: "Convolution"
  bottom: "st/inception_5b/pool"
  top: "st/inception_5b/pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/inception_5b/relu_pool_proj"
  type: "ReLU"
  bottom: "st/inception_5b/pool_proj"
  top: "st/inception_5b/pool_proj"
}
layer {
  name: "st/inception_5b/output"
  type: "Concat"
  bottom: "st/inception_5b/1x1"
  bottom: "st/inception_5b/3x3"
  bottom: "st/inception_5b/5x5"
  bottom: "st/inception_5b/pool_proj"
  top: "st/inception_5b/output"
}
layer {
  name: "st/final_conv"
  type: "Convolution"
  bottom: "st/inception_5b/output"
  top: "st/final_conv"
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/final_conv/relu"
  type: "ReLU"
  bottom: "st/final_conv"
  top: "st/final_conv"
}
layer {
  name: "st/final_ip"
  type: "InnerProduct"
  bottom: "st/final_conv"
  top: "st/final_ip"
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "st/final_ip/relu"
  type: "ReLU"
  bottom: "st/final_ip"
  top: "st/final_ip"
}
layer {
  name: "st/theta_1"
  type: "InnerProduct"
  bottom: "st/final_ip"
  top: "st/pre_theta_1"
  param {
    lr_mult: 0.1
    decay_mult: 10
  }
  param {
    lr_mult: 0.1
    decay_mult: 10
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "gaussian"
      std: 1e-4
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "st/theta_1_final"
  type: "PowerFile"
  bottom: "st/pre_theta_1"
  top: "st/theta_1"
  power_file_param {
    shift_file: "models/CUB_googLeNet_ST/bias_init_1.txt"
  }
}
layer {
  name: "loss/theta_1"
  type: "STLoss"
  bottom: "st/theta_1"
  top: "loss/theta_1"
  loss_weight: 10
  st_loss_param {
    output_H: 224
    output_W: 224
  }
}
layer {
  name: "st_1"
  type: "SpatialTransformer"
  bottom: "data"
  bottom: "st/theta_1"
  top: "inc1/data"
  st_param {
    to_compute_dU: false
    output_H: 224
    output_W: 224
  }
}
layer {
  name: "st/theta_2"
  type: "InnerProduct"
  bottom: "st/final_ip"
  top: "st/pre_theta_2"
  param {
    lr_mult: 0.1
    decay_mult: 10
  }
  param {
    lr_mult: 0.1
    decay_mult: 10
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "gaussian"
      std: 1e-4
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "st/theta_2_final"
  type: "PowerFile"
  bottom: "st/pre_theta_2"
  top: "st/theta_2"
  power_file_param {
    shift_file: "models/CUB_googLeNet_ST/bias_init_2.txt"
  }
}
layer {
  name: "loss/theta_2"
  type: "STLoss"
  bottom: "st/theta_2"
  top: "loss/theta_2"
  loss_weight: 10
  st_loss_param {
    output_H: 224
    output_W: 224
  }
}
layer {
  name: "st_2"
  type: "SpatialTransformer"
  bottom: "data"
  bottom: "st/theta_2"
  top: "inc2/data"
  st_param {
    to_compute_dU: false
    output_H: 224
    output_W: 224
  }
}
layer {
  name: "inc1/conv1/7x7_s2"
  type: "Convolution"
  bottom: "inc1/data"
  top: "inc1/conv1/7x7_s2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inc1/conv1/relu_7x7"
  type: "ReLU"
  bottom: "inc1/conv1/7x7_s2"
  top: "inc1/conv1/7x7_s2"
}
layer {
  name: "inc1/pool1/3x3_s2"
  type: "Pooling"
  bottom: "inc1/conv1/7x7_s2"
  top: "inc1/pool1/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inc1/pool1/norm1"
  type: "LRN"
  bottom: "inc1/pool1/3x3_s2"
  top: "inc1/pool1/norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "inc1/conv2/3x3_reduce"
  type: "Convolution"
  bottom: "inc1/pool1/norm1"
  top: "inc1/conv2/3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inc1/conv2/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inc1/conv2/3x3_reduce"
  top: "inc1/conv2/3x3_reduce"
}
layer {
  name: "inc1/conv2/3x3"
  type: "Convolution"
  bottom: "inc1/conv2/3x3_reduce"
  top: "inc1/conv2/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inc1/conv2/relu_3x3"
  type: "ReLU"
  bottom: "inc1/conv2/3x3"
  top: "inc1/conv2/3x3"
}
layer {
  name: "inc1/conv2/norm2"
  type: "LRN"
  bottom: "inc1/conv2/3x3"
  top: "inc1/conv2/norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "inc1/pool2/3x3_s2"
  type: "Pooling"
  bottom: "inc1/conv2/norm2"
  top: "inc1/pool2/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inc1/inception_3a/1x1"
  type: "Convolution"
  bottom: "inc1/pool2/3x3_s2"
  top: "inc1/inception_3a/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inc1/inception_3a/relu_1x1"
  type: "ReLU"
  bottom: "inc1/inception_3a/1x1"
  top: "inc1/inception_3a/1x1"
}
layer {
  name: "inc1/inception_3a/3x3_reduce"
  type: "Convolution"
  bottom: "inc1/pool2/3x3_s2"
  top: "inc1/inception_3a/3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inc1/inception_3a/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inc1/inception_3a/3x3_reduce"
  top: "inc1/inception_3a/3x3_reduce"
}
layer {
  name: "inc1/inception_3a/3x3"
  type: "Convolution"
  bottom: "inc1/inception_3a/3x3_reduce"
  top: "inc1/inception_3a/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inc1/inception_3a/relu_3x3"
  type: "ReLU"
  bottom: "inc1/inception_3a/3x3"
  top: "inc1/inception_3a/3x3"
}
layer {
  name: "inc1/inception_3a/5x5_reduce"
  type: "Convolution"
  bottom: "inc1/pool2/3x3_s2"
  top: "inc1/inception_3a/5x5_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inc1/inception_3a/relu_5x5_reduce"
  type: "ReLU"
  bottom: "inc1/inception_3a/5x5_reduce"
  top: "inc1/inception_3a/5x5_reduce"
}
layer {
  name: "inc1/inception_3a/5x5"
  type: "Convolution"
  bottom: "inc1/inception_3a/5x5_reduce"
  top: "inc1/inception_3a/5x5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inc1/inception_3a/relu_5x5"
  type: "ReLU"
  bottom: "inc1/inception_3a/5x5"
  top: "inc1/inception_3a/5x5"
}
layer {
  name: "inc1/inception_3a/pool"
  type: "Pooling"
  bottom: "inc1/pool2/3x3_s2"
  top: "inc1/inception_3a/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inc1/inception_3a/pool_proj"
  type: "Convolution"
  bottom: "inc1/inception_3a/pool"
  top: "inc1/inception_3a/pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inc1/inception_3a/relu_pool_proj"
  type: "ReLU"
  bottom: "inc1/inception_3a/pool_proj"
  top: "inc1/inception_3a/pool_proj"
}
layer {
  name: "inc1/inception_3a/output"
  type: "Concat"
  bottom: "inc1/inception_3a/1x1"
  bottom: "inc1/inception_3a/3x3"
  bottom: "inc1/inception_3a/5x5"
  bottom: "inc1/inception_3a/pool_proj"
  top: "inc1/inception_3a/output"
}
layer {
  name: "inc1/inception_3b/1x1"
  type: "Convolution"
  bottom: "inc1/inception_3a/output"
  top: "inc1/inception_3b/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inc1/inception_3b/relu_1x1"
  type: "ReLU"
  bottom: "inc1/inception_3b/1x1"
  top: "inc1/inception_3b/1x1"
}
layer {
  name: "inc1/inception_3b/3x3_reduce"
  type: "Convolution"
  bottom: "inc1/inception_3a/output"
  top: "inc1/inception_3b/3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inc1/inception_3b/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inc1/inception_3b/3x3_reduce"
  top: "inc1/inception_3b/3x3_reduce"
}
layer {
  name: "inc1/inception_3b/3x3"
  type: "Convolution"
  bottom: "inc1/inception_3b/3x3_reduce"
  top: "inc1/inception_3b/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inc1/inception_3b/relu_3x3"
  type: "ReLU"
  bottom: "inc1/inception_3b/3x3"
  top: "inc1/inception_3b/3x3"
}
layer {
  name: "inc1/inception_3b/5x5_reduce"
  type: "Convolution"
  bottom: "inc1/inception_3a/output"
  top: "inc1/inception_3b/5x5_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inc1/inception_3b/relu_5x5_reduce"
  type: "ReLU"
  bottom: "inc1/inception_3b/5x5_reduce"
  top: "inc1/inception_3b/5x5_reduce"
}
layer {
  name: "inc1/inception_3b/5x5"
  type: "Convolution"
  bottom: "inc1/inception_3b/5x5_reduce"
  top: "inc1/inception_3b/5x5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inc1/inception_3b/relu_5x5"
  type: "ReLU"
  bottom: "inc1/inception_3b/5x5"
  top: "inc1/inception_3b/5x5"
}
layer {
  name: "inc1/inception_3b/pool"
  type: "Pooling"
  bottom: "inc1/inception_3a/output"
  top: "inc1/inception_3b/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inc1/inception_3b/pool_proj"
  type: "Convolution"
  bottom: "inc1/inception_3b/pool"
  top: "inc1/inception_3b/pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inc1/inception_3b/relu_pool_proj"
  type: "ReLU"
  bottom: "inc1/inception_3b/pool_proj"
  top: "inc1/inception_3b/pool_proj"
}
layer {
  name: "inc1/inception_3b/output"
  type: "Concat"
  bottom: "inc1/inception_3b/1x1"
  bottom: "inc1/inception_3b/3x3"
  bottom: "inc1/inception_3b/5x5"
  bottom: "inc1/inception_3b/pool_proj"
  top: "inc1/inception_3b/output"
}
layer {
  name: "inc1/pool3/3x3_s2"
  type: "Pooling"
  bottom: "inc1/inception_3b/output"
  top: "inc1/pool3/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inc1/inception_4a/1x1"
  type: "Convolution"
  bottom: "inc1/pool3/3x3_s2"
  top: "inc1/inception_4a/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inc1/inception_4a/relu_1x1"
  type: "ReLU"
  bottom: "inc1/inception_4a/1x1"
  top: "inc1/inception_4a/1x1"
}
layer {
  name: "inc1/inception_4a/3x3_reduce"
  type: "Convolution"
  bottom: "inc1/pool3/3x3_s2"
  top: "inc1/inception_4a/3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inc1/inception_4a/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inc1/inception_4a/3x3_reduce"
  top: "inc1/inception_4a/3x3_reduce"
}
layer {
  name: "inc1/inception_4a/3x3"
  type: "Convolution"
  bottom: "inc1/inception_4a/3x3_reduce"
  top: "inc1/inception_4a/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 208
    pad: 1
